Autodesk.Revit.DB.Structure.DistributionType
The type of the distribution

Autodesk.Revit.DB.Structure.DistributionType.VaryingLength
It is a varying length distribution.

Autodesk.Revit.DB.Structure.DistributionType.Uniform
It is an uniform distribution.